<a href="https://colab.research.google.com/github/maniac-coding/mynewgit/blob/master/Week2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## The series Data structure

In [0]:
import pandas as pd
pd.Series?

In [9]:
animal = ['Tiger', 'Cat','Dog']
pd.Series(animal)

0    Tiger
1      Cat
2      Dog
dtype: object

In [10]:
numbers = [1,2,3,4]
pd.Series(numbers)

0    1
1    2
2    3
3    4
dtype: int64

In [17]:
dictonary = {'Delhi': 'India', 'Dhaka ': 'Shri lanka', 'kathmandu': 'Nepal' , 'Islamabad': 'Pakistan' }
pd.Series(dictonary)

Delhi             India
Dhaka        Shri lanka
kathmandu         Nepal
Islamabad      Pakistan
dtype: object

In [32]:
s=pd.Series([' Laptop','Washing Machine', 'Cell phone'], index = ['Hp', 'Samsung', 'Apple'])
s

Hp                  Laptop
Samsung    Washing Machine
Apple           Cell phone
dtype: object

In [33]:
s.index

Index(['Hp', 'Samsung', 'Apple'], dtype='object')

In [36]:
s.values

array([' Laptop', 'Washing Machine', 'Cell phone'], dtype=object)

In [37]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
m = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
m

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

## Quering The series

In [43]:
Universities = {'Kanpur': "IIT kan.",'Delhi': 'GGSIPU', 'UP':'UPTU'}
s=pd.Series(Universities)
s

Kanpur    IIT kan.
Delhi       GGSIPU
UP            UPTU
dtype: object

In [44]:
s.iloc[2]

'UPTU'

In [45]:
s.loc['Delhi']

'GGSIPU'

In [55]:
pollution = {55 : 'India',77 : 'Russia' , 99: 'America'}
p=pd.Series(pollution)
print(p.iloc[1])

p.index

Russia

Int64Index([55, 77, 99], dtype='int64')

In [56]:
s = pd.Series([100,200,300,400,500])
s

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [63]:
%%timeit -n 100
value =0
for i in s:
  value+=i
value

100 loops, best of 3: 4.62 µs per loop

In [65]:
%%timeit -n 100
import numpy as np
total = np.sum(s)

100 loops, best of 3: 73.8 µs per loop

In [66]:
s =  pd.Series(np.random.randint(0,1000,10000))
s.head()

0    660
1    940
2    216
3    380
4    270
dtype: int64

In [68]:
%%timeit -n 500
value =0
for i in s:
  value+=i

500 loops, best of 3: 1.19 ms per loop

In [69]:
%%timeit -n 500
total = np.sum(s)

500 loops, best of 3: 79.9 µs per loop

In [75]:
s+=2
s.head()

0    662
1    942
2    218
3    382
4    272
dtype: int64

In [79]:
for label,values in s.iteritems():
  s.iat(label,values+2)
s.head()

TypeError: ignored

## DataFrame Data structure

In [0]:
import pandas as pd

In [93]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1,purchase_2,purchase_3],index = ['Store 1','Store 1','Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [94]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [95]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [96]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [97]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [98]:
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [101]:
df.loc[:,['Name','Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [107]:
df.drop('Store 1')

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [108]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [110]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [111]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [0]:
copy_df.drop?

In [113]:
del copy_df['Name']
copy_df

        Item Purchased  Cost
Store 2      Bird Seed   5.0

In [114]:
df["Location"] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevyn   Kitty Litter   2.5     None
Store 2  Vinod      Bird Seed   5.0     None

In [115]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5
Location            None          None       None

In [116]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object